# 1. Створить вектор v із 100 елементів командою v <- rnorm(100).
# Для цього вектору виведіть: 10-й елемент; елементи з 10-го по 20-й включно; 
# 10 елементів починаючи з 20-го; елементи більше 0.
v <- rnorm(100)
print(v[10])
print(v[10:20])
print(v[20:29])
print(v[which(v > 0)])

# 2. Створіть фрейм (data frame) y командою 
# y <- data.frame(a = rnorm(100), b = 1:100, cc = sample(letters, 100, replace = TRUE)). 
# Для цього data frame виведіть: останні 10 строк; строки з 10 по 20 включно; 
# 10-й елемент стовпця b; повністю стовпець cc, при цьому використайте ім’я стовпця.
y <- data.frame(a = rnorm(100), b = 1:100, cc = sample(letters, 100, replace = TRUE))
print(tail(y, 10))
print(tail(head(y, 20), 11))
print(y$b[[10]])
print(y$cc)

# 3. Створіть вектор z з елементами 1, 2, 3, NA, 4, NA, 5, NA. 
# Для цього вектору: виведіть всі елементи, які не NA; 
# підрахуйте середнє значення всіх елементів цього вектору без NA значень та з NA значеннями.
z <- c(1, 2, 3, NA, 4, NA, 5, NA)
idx <- which(z %in% NA)
z2 = z[-idx]
print(z2)
average_z = mean(z)
average_z2 = mean(z2)

print(average_z)
# output NA
print(average_z2)
# output 3

[1] -1.558201
 [1] -1.5582008 -0.2496661 -0.6978489 -0.3088590  0.7396364  1.5020379
 [7]  0.8389493 -0.9937421 -1.0142436  1.7956825  0.5081764
 [1]  0.50817645 -2.21415799 -0.63692948  1.14933860  0.50234035  0.10113884
 [7]  0.18358962  0.73248828 -2.77822094 -0.03566006
 [1] 0.77581318 1.50149025 0.61015665 0.73963637 1.50203786 0.83894926
 [7] 1.79568250 0.50817645 1.14933860 0.50234035 0.10113884 0.18358962
[13] 0.73248828 1.07909081 0.17601239 0.14903139 1.17277818 0.85516776
[19] 0.77295836 0.71974101 1.24651867 0.78392305 0.01993195 0.03752466
[25] 0.04528910 2.93033599 0.02562832 0.09852026 0.22269950 0.19295349
[31] 0.11613587 2.04958570 0.15388379 1.90907014 0.56595540 0.80334223
[37] 0.26313854 0.88459532 1.68266815 1.00762647 0.65539990 0.88442251
[43] 1.39582988 0.01882550 0.84452620 1.45473812 0.20336567 0.46100447
[49] 0.66180288 0.43187405 0.10848326 0.75366687 0.46696899 1.64275988
             a   b cc
91   0.4451394  91  c
92   0.3573164  92  v
93   1.3681731  93  r
94  -0.8281129  94  g
95  -0.4726090  95  g
96  -0.9296562  96  s
97  -0.7792053  97  e
98   2.9377520  98  s
99   1.6407138  99  k
100  1.8873453 100  e
            a  b cc
10  0.0300145 10  y
11 -0.1037525 11  v
12  0.7911457 12  m
13 -0.3512656 13  x
14  0.4904635 14  j
15 -2.8137259 15  q
16 -1.7863400 16  n
17  0.3950379 17  z
18  0.9972465 18  a
19 -0.9989815 19  g
20 -0.2797102 20  y
[1] 10
  [1] z o u z l b j u o y v m x j q n z a g y y d x f e x e w y m s x t j o d m
 [38] l v v x s s x p k a y v a n y q z i f v x j b v g h b r d h g q g x a k r
 [75] f w h g z f b t z y a m z a j v c v r g g s e s k e
Levels: a b c d e f g h i j k l m n o p q r s t u v w x y z
[1] 1 2 3 4 5
[1] NA
[1] 3
